In [1]:
import pandas as pd

lst = ['Apple', 'Orange', 'Mango', 'Kiwi', 'Pineapple', 'Papaya']

df = pd.DataFrame(lst)
df

           0
0      Apple
1     Orange
2      Mango
3       Kiwi
4  Pineapple
5     Papaya

In [2]:
reg_no = ['19BCE0001', '19BCE0002', '19BCE0003']
name = ['Alex', 'Bob', 'Cynthia']
m1 = [30, 50, 70]
m2 = [50, 70, 30]
m3 = [70, 30, 50]

data = {
    "Reg. No": reg_no,
    "Name": name,
    "Mark 1": m1,
    "Mark 2": m2,
    "Mark 3": m3
}

d = pd.DataFrame(data)
d['total'] = d['Mark 1'] + d['Mark 2'] + d['Mark 3']
d.to_csv('data.csv')

d

     Reg. No     Name  Mark 1  Mark 2  Mark 3  total
0  19BCE0001     Alex      30      50      70    150
1  19BCE0002      Bob      50      70      30    150
2  19BCE0003  Cynthia      70      30      50    150